Table of Contents
 Struct Point
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
public struct Point
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.GetType()
 object.ReferenceEquals(object, object)
Constructors
 Point(double, double)
public Point(double x, double y)
Parameters
x double
y double
Properties
 X
public double X { get; set; }
Property Value
double
 Y
public double Y { get; set; }
Property Value
double
 Edit this page